import "./TermsConditions.css";

function Legal()
{
    return (
        <div className="termsPage">
            <div className="termsContainer">

                <h1 className="termsTitle">
                    Legal
                </h1>

                <p className="termsIntro">
                    Інформаційний характер матеріалів<br /><br />

                    Усі шаблони договорів, інструкції та відеоматеріали у Базі знань OBC мають виключно освітній та рекомендаційний характер. Хоча вони розроблені професіоналами, вони не замінюють повноцінної юридичної, фінансової чи податкової консультації з урахуванням специфіки саме вашої ситуації.
                </p>

                <div className="termsTextBlock">

                    <h2>Статус експертів</h2>
                    <p>
                        Експерти платформи OBC (юристи, HR-фахівці, менеджери) є незалежними підрядниками.<br />
                        Платформа виступає зручним майданчиком для вашого зв'язку.<br />
                        Якщо ви вирішуєте укласти з експертом договір на довгостроковий супровід поза межами платформи, OBC не виступає стороною цієї угоди.
                    </p>

                    <h2>Інтелектуальна власність</h2>
                    <p>
                        Увесь контент платформи (тексти, дизайн, відео, алгоритми) належить OBC та захищений законом про авторське право.<br />
                        Ви маєте право завантажувати шаблони документів і адаптувати їх для власного бізнесу.<br />
                        Однак категорично забороняється перепродувати наші шаблони, публікувати їх у відкритому доступі або використовувати для створення конкуруючого продукту.
                    </p>

                </div>

                <div className="termsBottom">

                    <h3>Залишись питання?</h3>

                    <p>Зконтактуйте нашу лігал підтримку, щоб задати ваші питання</p>

                    <button className="termsButton">
                        Email: legal@obc.platform
                    </button>

                </div>

            </div>
        </div>
    );
}

export default Legal;