import "./TermsConditions.css";

function TermsConditions()
{
    return (
        <div className="termsPage">
            <div className="termsContainer">

                <h1 className="termsTitle">
                    Terms & Conditions
                </h1>

                <p className="termsIntro">
                    Ці умови регулюють ваше використання нашої платформи, бази знань та консалтингових послуг. Реєструючись на сайті, ви погоджуєтесь із цими правилами.
                </p>

                <div className="termsTextBlock">

                    <h2>Підписка та Оплата</h2>
                    <p>
                        Доступ до Бази знань OBC надається за моделлю щомісячної підписки.<br />
                        Оплата списується автоматично на початку кожного розрахункового періоду (рекурентний платіж).<br />
                        Ви можете скасувати підписку в будь-який момент в Особистому кабінеті. Після скасування доступ до матеріалів зберігається до кінця оплаченого місяця.<br />
                        Послуги "живих" консультацій з експертами можуть тарифікуватися окремо або входити у преміум-тарифи.
                    </p>

                    <h2>Обліковий запис</h2>
                    <p>
                        Ваш акаунт є персональним (або корпоративним для одного бізнесу). Забороняється передавати логін та пароль третім особам.<br />
                        Ми залишаємо за собою право заблокувати акаунт у разі виявлення підозрілої активності (наприклад, масового скачування шаблонів ботами).
                    </p>

                    <h2>Відмова від гарантій</h2>
                    <p>
                        Ми надаємо інструменти, знання та доступ до фахівців, але успіх вашого бізнесу залежить виключно від вас.
                        OBC не несе відповідальності за фінансові втрати, упущену вигоду чи бізнес-помилки.
                    </p>

                </div>

                <div className="termsBottom">

                    <h3>Залишись питання?</h3>

                    <p>Зконтактуйте нашу лігал підтримку, щоб задати ваші питання</p>

                    <button className="termsButton">
                        Email: legal@obc.platform
                    </button>

                </div>

            </div>
        </div>
    );
}

export default TermsConditions;